# 横方向・縦方向のマスの数
# 動かせる部分は20*20だが、六角形表示のため上下左右に余分に作成している。
NUM_WIDTH = 30
NUM_HEIGHT = 22
# 中央座標の取り方
# (x,y)の時、(h_w*x, h_w1_4 + h_w3_4*y)
# 原作にはないが建物破壊をするシステムを採用するのであれば、可変可能なマップを生成できるのが良い
# 何かしらアルゴリズムを組んで下の建物描画方法切り替えで対応する

# 原作：建物の描画方法（四角型と角合わせ型）の二種類
#四角型     ： 六角形の一番離れた位置のxyに頂点を合わせるやり方六角形の上部がはみ出ているみたいな感じ
#角合わせ型 ： 六角形の辺に沿って、五角形型の建物にするこれだと綺麗に六角形が埋まる感じ

class Map:
    def __init__(self):
        '''コンストラクタ''' 
        # 1回で登れる高さは2まで
        # -1:進行不可, 0:平地, 1:高さ1の建物, 2:高さ2の建物, 3:高さ3の建物, 4:高さ4の建物, 5:高さ5の建物
        # 盤面上のマップを管理する2次元リスト
        self.board = [  [-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1],
                        [-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1]]
        self.h_w = 51.15
        self.h_w1_4 = self.h_w / 4
        self.h_w1_2 = self.h_w / 2
        self.h_w3_4 = self.h_w * (3 / 4)

        self.h_h = 59.2
        self.h_h3_4 = self.h_h * (3 / 4)
        self.h_h1_4 = self.h_h / 4
        self.h_h1_2 = self.h_h / 2

        # ゲームの初期化
        self.initMap()

    def initMap(self):
        '''マップの初期化を行う'''

        # 盤面上の石を管理する２次元リストを作成（最初は全てNone）
        #[[None for _ in range(10)] for _ in range(10)]
        #self.board = [[None for j in range(NUM_WIDTH)] for i in range(NUM_HEIGHT)]

        self.m_xy = []
        # マスを描画    30 * 30 = 900
        for y in range(NUM_HEIGHT):
            for x in range(NUM_WIDTH):
                # 開始・終了座標を計算
                if y % 2 == 0:
                    #   北東の点
                    xne = self.h_w * (x + 1) - self.h_w1_2
                    yne = self.h_h1_4 + (self.h_h3_4 * y) - self.h_h1_4
                    #   北の点
                    xn = self.h_w1_2 + (self.h_w * x) - self.h_w1_2
                    yn = self.h_h3_4 * y - self.h_h1_4
                    #   北西の点
                    xns = self.h_w * x - self.h_w1_2   #0スタートなので、最初は0でいい
                    yns = yne
                    #   南西の点
                    xws = xns
                    yws = (self.h_h3_4 * (y + 1)) - self.h_h1_4
                    #   南の点
                    xw = xn
                    yw = self.h_h + (self.h_h3_4 * y) - self.h_h1_4
                    #   南東の点
                    xwe = xne
                    ywe = yws
                elif y % 2 == 1:
                    #   北東の点
                    xne = self.h_w * (x + 1) + self.h_w1_2 - self.h_w1_2
                    yne = self.h_h + (self.h_h3_4 * (y - 1)) - self.h_h1_4
                    #   北の点
                    xn = self.h_w * (x + 1) - self.h_w1_2
                    yn = self.h_h3_4 * y - self.h_h1_4
                    #   北西の点
                    xns = (self.h_w * x) + self.h_w1_2 - self.h_w1_2    #yが奇数なので、最初は22.5から
                    yns = yne
                    #   南西の点
                    xws = xns
                    yws = self.h_h3_4 * (y + 1) - self.h_h1_4
                    #   南の点
                    xw = xn
                    yw = self.h_h1_4 + (self.h_h3_4 * (y +1)) - self.h_h1_4
                    #   南東の点
                    xwe = xne
                    ywe = yws
                self.m_xy.append([x, y, xne, yne, xn, yn, xns, yns, xws, yws, xw, yw, xwe, ywe])
        return self.m_xy



